Tekla.Structures.DialogInternal.ManagedShapeSelectionDialogInterface
Handles access to object dialog callbacks

Tekla.Structures.DialogInternal.ManagedShapeSelectionDialogInterface.AttributeRequestedEvent
The attribute requested event

Tekla.Structures.DialogInternal.ManagedShapeSelectionDialogInterface.UseOldShapeCatalog
Environment value for old shape catalog
Returns: false if event handler is not specified , true otherwise

Tekla.Structures.DialogInternal.ManagedShapeSelectionDialogInterface.AttributeRequestedCallback(Tekla.Structures.DialogInternal.IDialogOwner,System.String)
Callback function to be called from forms dialog
caller: Caller control
shape: Shape name
Returns: false if event handler is not specified , true otherwise